In [2]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### For these exercises you have to use the students table that was created in the previous notebook

### 1. Select all students whose major is Computer Science.

In [4]:
%%sql 
SELECT name, major FROM students
WHERE major = 'Computer Science';

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[('Alice', 'Computer Science'), ('Diana', 'Computer Science')]

### 2. Select students whose age is greater than 20.

In [5]:
%%sql
SELECT * FROM students
WHERE age > 20;

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[(2, 'Bob', 22, 'Economics'), (4, 'Diana', 21, 'Computer Science')]

### 3. Select students whose major is Computer Science and age is less than 22.

In [6]:
%%sql
SELECT * FROM students
WHERE major = 'Computer Science' AND age < 22;

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[(1, 'Alice', 20, 'Computer Science'), (4, 'Diana', 21, 'Computer Science')]

### 4. Select students who do not have a major assigned.

In [7]:
%%sql 
SELECT * FROM students
WHERE major IS NULL;

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[(5, 'Eve', 18, None)]

### 5. Select students whose major is Computer Science, Chemistry, or Economics.

In [8]:
%%sql
SELECT * FROM students
WHERE major IN ('Computer Science', 'Chemistry', 'Economics');

 * postgresql://user:***@localhost:5432/postgres
4 rows affected.

[(1, 'Alice', 20, 'Computer Science'),
 (2, 'Bob', 22, 'Economics'),
 (3, 'Charlie', 19, 'Chemistry'),
 (4, 'Diana', 21, 'Computer Science')]

### 6. Count how many students are in each major, but only show majors with more than 1 student.

In [19]:
%%sql
SELECT major, COUNT(*) as major_count FROM students
GROUP BY major
HAVING COUNT(*) > 1;

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[('Computer Science', 2)]

### 7. Find majors where the average age of students is greater than 20.

In [36]:
%%sql
SELECT major, ROUND(AVG(age),1) as avg_age FROM students
GROUP BY major
HAVING AVG(age) > 20;

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[('Computer Science', Decimal('20.5')), ('Economics', Decimal('22.0'))]

### 8. Show majors with more than 1 student and an average age greater than 20.

In [37]:
%%sql
SELECT major, COUNT(*) as student_count, ROUND(AVG(age),1) as avg_age FROM students
GROUP BY major
HAVING COUNT(*) > 1 AND AVG(age) > 20;

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[('Computer Science', 2, Decimal('20.5'))]

### 9. Select students who do not have a major assigned.

In [39]:
%%sql 
SELECT name, major FROM students
WHERE major IS NULL;

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[('Eve', None)]

### 10. Select only students whose age is greater than 18, group them by major, and show only majors with more than 1 student.

In [49]:
%%sql
SELECT major, COUNT(*) FROM students
WHERE age > 18
GROUP BY major
HAVING COUNT(*) > 2;

 * postgresql://user:***@localhost:5432/postgres
0 rows affected.

[]